Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.CannotPutELZInOption
Area Based Loads must be in the Main Model.

Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.CannotPutELAInOption
Electrical Load Areas must be in the Main Model.